sdaiValidateStringWidth(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether all STRING-valued attributes of the specified application instance are of a valid width.
Retrieves the non-persistent list of attributes with invalid width, if found.
\param appInstance [in]  Identifier of the application instance to be validated.
\param list        [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE if attributes with invalid width are not found.
* sdaiFALSE if such attributes are found.
* sdaiUNKNOWN if an error is encountered.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Entity instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance ifcLibraryReferenceInstance = sdaiCreateInstanceBN(model, "ifclibraryreference");
SdaiNPL npl = sdaiCreateNPL();
SdaiLogical requiredOk = sdaiValidateStringWidth(ifcLibraryReferenceInstance, npl); //sdaiTRUE
sdaiPutAttrBN(ifcLibraryReferenceInstance, "language", sdaiSTRING, "English");
requiredOk = sdaiValidateStringWidth(ifcLibraryReferenceInstance, npl); //sdaiTRUE
SdaiString attributeString = "012345678900012345678900012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890012345678900123456789001234567890";
sdaiPutAttrBN(ifcLibraryReferenceInstance, "language", sdaiSTRING, attributeString);
requiredOk = sdaiValidateStringWidth(ifcLibraryReferenceInstance, npl); //sdaiFALSE